package org.kata.kyu_8;

/*
Создайте функцию, которая возвращает сумму двух наименьших положительных чисел из массива,
содержащего минимум 4 положительных целых числа. В массиве не будет дробных чисел или неположительных значений.
🔹 Для Java входные числа будут представлены в виде long (числа с двойной точностью хранения).*/

import java.lang.reflect.Array;
import java.util.Arrays;

/*public class TwoSmallestNumbers {
    public static long sumTwoSmallestNumbers(long[] numbers) {
        System.out.println(numbers);
        Arrays.sort(numbers);
        System.out.println(numbers);
        return 0L;
    }

    public static void main(String[] args) {
        sumTwoSmallestNumbers([1,2,3,4]);
//        sumTwoSmallestNumbers([1,23,4,5,])
    }
}*/
